Lesson-1.org
#+TITLE: CHAPTER 1
#+DESCRIPTION: chapter 1 in cisco 2
#+AUTHOR: Emmanuel Parreno

* Chapter 1: Basic Device Configuration
** 1.1 Configure a switch with initial settings
***  Switch boot sequence
Before a switch is configured, it goes through a five-step boot
sequence

1. loads a power-on self-test (POST) program stored in ROM
2. loads the boot loader software
3. boot loader performs low-level CPU initialization. It initializes
   the CPU registers which control where physical memory is mapped,
   the quantity of the memory, and its speed
4. the boot loader initializes the flash file system on the system board
5. the boot loader locates and loads a default IOS operating system
   software image into memory and gives control of the switch over to
   the IOS

***  The boot system command
An environment variable (*BOOT environment variable*) is used by the
switches to automatically boot to a specific IOS. If it is not set,
the switch attempts to load and execute the first executatble file it
can find.

Admins can use the command ~show boot~ to shut which IOS is currently
running. To boot a different IOS to the switch use the command:

#+BOOT COMMAND
#+BEGIN_SRC
S1(config)# boot system flash:/c2960-lanbasek9-mz.150-2.SE/c2960-lanbasek9-mz.150-2.SE.bin
#+END_SRC

***  Switch LED Indicators
1. SYST
   - shows whether the system is receiving power and is functioning properly
   - OFF: system is off
   - GREEN: system is operating normally
   - AMBER: system is receiving power but is not functioning properly
2. RPS
   - redundant power system
   - OFF: RPS is off and/or not properly connected
   - GREEN: connected and ready to provide backup power
   - BLINKING GREEN: RPS is connected but is unavailable because of
     providing power to other device
   - AMBER: RPS is in standby mode or in a fault condition
   - BLINKING AMBER: internal power supply in the switch has failed,
     RPS is providing power
3. STAT
   - Port status LED
   - when whathever GREEN: port status mode is delected (this is the
     default mode)
   - OFF: no link or the port is administratively shutdown
   - GREEN: link is present
   - BLINKING GREEN: there is activity and the port is sending or
     receiving data
   - ALTERNATING GREEN-AMBER: there is a link fault
   - AMBER: the port is blocked to ensure that a loop does not exist
     in the forwarding domain
   - BLINKING AMBER: port is blocked to prevent a possible loop in the
     forwarding domain
4. DUPLX
   - whenever green: duplex mode is selected
   - OFF: half-duplex mode
   - GREEN: full-duplex mode
5. SPEED
   - indicates that the  port speed mode is selected
   - OFF: port operating at 10Mbps
   - GREEN: port operating at 100Mbps
   - BLINKING GREEN: port operating at 1000Mbps
6. PoE
   - Power over ethernet
   - OFF: PoE mode is not selected
   - BLINKING AMBER: PoE mode not selected but at least 1 port has
     denied power or placed in a faulty condition
   - GREEN: PoE is on
   - GREEN-AMBER: denied power because the switch power capacity will
     be exceeded by the port

***  Recovering from a System Crash
The boot loader provides access into the switch if the operating
system cannot be used because of missing or damaged system files. The
boot loader has a command-line that provides access to the files
stored in flash memory

The boot loader can be accessed through a console connection through
the following steps:

1. connect a PC via console
2. unplug the switch power cord
3. reconnect the power cord to the switch and within 15 secs, press
   and hold down the mode button while the system LED is still
   flashing green
4. continue until the system LED turns briefly amber and then solid
   green; then release the mode button
5. the boot loader prompt appears in the terminal emulation software
   on the PC.


**** Process of recovering
1. set the BOOT variable through the command ~set BOOT=__file_location_here__~
2. initialize the flash file system using ~flash_init~
3. after initializing the flash file system, it can be viewed using
   the command ~dir flash:~
4. use the command ~BOOT=flash~ to change the boot environment
   variable path te switch uses to load the new IOS in flash
5. (verification) issue the ~set~ command
6. enter ~boot~ to load the new IOS type

***  Switch Management Access
To prepare for remote management access, a switch must have a *SVI
(switch virtual interface)* configured with an *IPv4 address and a
subnet mask* or *IPv6 and a prefix length*.

SVI
  - is not a physical port on the switch

/NOTE/: to manage a switch from a remote network, it must be
configured with a *default gateway* (similar to how end devices need
a default gateway).

