Lesson-1.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-02-10 Mon 07:32 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>CHAPTER 1</title>
<meta name="author" content="Emmanuel Parreno" />
<meta name="description" content="chapter 1 in cisco 2" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">CHAPTER 1</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org19f3f0c">1. Chapter 1: Basic Device Configuration</a>
<ul>
<li><a href="#org6f648eb">1.1. 1.1 Configure a switch with initial settings</a>
<ul>
<li><a href="#orgef928ee">1.1.1. Switch boot sequence</a></li>
<li><a href="#org15d863c">1.1.2. The boot system command</a></li>
<li><a href="#org59bb6b0">1.1.3. Switch LED Indicators</a></li>
<li><a href="#org659272e">1.1.4. Recovering from a System Crash</a></li>
<li><a href="#orgdb20cc1">1.1.5. Switch Management Access</a></li>
<li><a href="#org8291062">1.1.6. Switch SVI Configuration Example</a></li>
</ul>
</li>
<li><a href="#org1926a14">1.2. 1.2 Configure Switch Ports</a>
<ul>
<li><a href="#orgf407865">1.2.1. Duplex Communication</a></li>
<li><a href="#org6c8187f">1.2.2. Configure switch ports at the physical layer</a></li>
<li><a href="#org2e4a2aa">1.2.3. Auto-MDIX (automatic medium-dependent-interface crossover)</a></li>
<li><a href="#orgbf14f78">1.2.4. verify switch port configuration</a></li>
<li><a href="#org73b8a8f">1.2.5. Network Access layer issues</a></li>
<li><a href="#org1d8e421">1.2.6. Interface input and output errors</a></li>
<li><a href="#org035ab59">1.2.7. Troubleshooting network access layer issues</a></li>
</ul>
</li>
<li><a href="#orgafeae6d">1.3. Secure remote access</a>
<ul>
<li><a href="#orga73005c">1.3.1. Telnet operation</a></li>
<li><a href="#org7b441f7">1.3.2. SSH Operation</a></li>
<li><a href="#org7136b21">1.3.3. Verify the switch supports SSH</a></li>
<li><a href="#org065cd94">1.3.4. Configure SSH</a></li>
<li><a href="#orge0d46e5">1.3.5. Verify SSH</a></li>
</ul>
</li>
<li><a href="#org7b611e7">1.4. Basic Router Configuration</a>
<ul>
<li><a href="#org621e905">1.4.1. Configure basic router settings</a></li>
<li><a href="#org955d1da">1.4.2. Dual Stack Topology</a></li>
<li><a href="#org0318299">1.4.3. Configure Router Interfaces</a></li>
<li><a href="#org8dd629b">1.4.4. IPv4 Loopback Interfaces</a></li>
</ul>
</li>
<li><a href="#orgcc90b5b">1.5. Verify Directly Connected Networks</a>
<ul>
<li><a href="#orgeab2f30">1.5.1. Interface verification commands</a></li>
<li><a href="#org63689f2">1.5.2. Verify Interface Status</a></li>
<li><a href="#org6ee1152">1.5.3. Verify IPv6 Link Local and Multicase Addresses</a></li>
<li><a href="#org8d5f464">1.5.4. Verify Routes</a></li>
<li><a href="#org4227c38">1.5.5. Filter Show Command Output</a></li>
<li><a href="#orgcb5676b">1.5.6. Command History Feature</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org19f3f0c" class="outline-2">
<h2 id="org19f3f0c"><span class="section-number-2">1.</span> Chapter 1: Basic Device Configuration</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org6f648eb" class="outline-3">
<h3 id="org6f648eb"><span class="section-number-3">1.1.</span> 1.1 Configure a switch with initial settings</h3>
<div class="outline-text-3" id="text-1-1">
</div>
<div id="outline-container-orgef928ee" class="outline-4">
<h4 id="orgef928ee"><span class="section-number-4">1.1.1.</span> Switch boot sequence</h4>
<div class="outline-text-4" id="text-1-1-1">
<p>
Before a switch is configured, it goes through a five-step boot
sequence
</p>

<ol class="org-ol">
<li>loads a power-on self-test (POST) program stored in ROM</li>
<li>loads the boot loader software</li>
<li>boot loader performs low-level CPU initialization. It initializes
the CPU registers which control where physical memory is mapped,
the quantity of the memory, and its speed</li>
<li>the boot loader initializes the flash file system on the system board</li>
<li>the boot loader locates and loads a default IOS operating system
software image into memory and gives control of the switch over to
the IOS</li>
</ol>
</div>
</div>

<div id="outline-container-org15d863c" class="outline-4">
<h4 id="org15d863c"><span class="section-number-4">1.1.2.</span> The boot system command</h4>
<div class="outline-text-4" id="text-1-1-2">
<p>
An environment variable (<b>BOOT environment variable</b>) is used by the
switches to automatically boot to a specific IOS. If it is not set,
the switch attempts to load and execute the first executatble file it
can find.
</p>

<p>
Admins can use the command <code>show boot</code> to shut which IOS is currently
running. To boot a different IOS to the switch use the command:
</p>

<pre class="example" id="org1991a99">
S1(config)# boot system flash:/c2960-lanbasek9-mz.150-2.SE/c2960-lanbasek9-mz.150-2.SE.bin
</pre>
</div>
</div>

<div id="outline-container-org59bb6b0" class="outline-4">
<h4 id="org59bb6b0"><span class="section-number-4">1.1.3.</span> Switch LED Indicators</h4>
<div class="outline-text-4" id="text-1-1-3">
<ol class="org-ol">
<li>SYST
<ul class="org-ul">
<li>shows whether the system is receiving power and is functioning properly</li>
<li>OFF: system is off</li>
<li>GREEN: system is operating normally</li>
<li>AMBER: system is receiving power but is not functioning properly</li>
</ul></li>
<li>RPS
<ul class="org-ul">
<li>redundant power system</li>
<li>OFF: RPS is off and/or not properly connected</li>
<li>GREEN: connected and ready to provide backup power</li>
<li>BLINKING GREEN: RPS is connected but is unavailable because of
providing power to other device</li>
<li>AMBER: RPS is in standby mode or in a fault condition</li>
<li>BLINKING AMBER: internal power supply in the switch has failed,
RPS is providing power</li>
</ul></li>
<li>STAT
<ul class="org-ul">
<li>Port status LED</li>
<li>when whathever GREEN: port status mode is delected (this is the
default mode)</li>
<li>OFF: no link or the port is administratively shutdown</li>
<li>GREEN: link is present</li>
<li>BLINKING GREEN: there is activity and the port is sending or
receiving data</li>
<li>ALTERNATING GREEN-AMBER: there is a link fault</li>
<li>AMBER: the port is blocked to ensure that a loop does not exist
in the forwarding domain</li>
<li>BLINKING AMBER: port is blocked to prevent a possible loop in the
forwarding domain</li>
</ul></li>
<li>DUPLX
<ul class="org-ul">
<li>whenever green: duplex mode is selected</li>
<li>OFF: half-duplex mode</li>
<li>GREEN: full-duplex mode</li>
</ul></li>
<li>SPEED
<ul class="org-ul">
<li>indicates that the  port speed mode is selected</li>
<li>OFF: port operating at 10Mbps</li>
<li>GREEN: port operating at 100Mbps</li>
<li>BLINKING GREEN: port operating at 1000Mbps</li>
</ul></li>
<li>PoE
<ul class="org-ul">
<li>Power over ethernet</li>
<li>OFF: PoE mode is not selected</li>
<li>BLINKING AMBER: PoE mode not selected but at least 1 port has
denied power or placed in a faulty condition</li>
<li>GREEN: PoE is on</li>
<li>GREEN-AMBER: denied power because the switch power capacity will
be exceeded by the port</li>
</ul></li>
</ol>
</div>
</div>

<div id="outline-container-org659272e" class="outline-4">
<h4 id="org659272e"><span class="section-number-4">1.1.4.</span> Recovering from a System Crash</h4>
<div class="outline-text-4" id="text-1-1-4">
<p>
The boot loader provides access into the switch if the operating
system cannot be used because of missing or damaged system files. The
boot loader has a command-line that provides access to the files
stored in flash memory
</p>

<p>
The boot loader can be accessed through a console connection through
the following steps:
</p>

<ol class="org-ol">
<li>connect a PC via console</li>
<li>unplug the switch power cord</li>
<li>reconnect the power cord to the switch and within 15 secs, press
and hold down the mode button while the system LED is still
flashing green</li>
<li>continue until the system LED turns briefly amber and then solid
green; then release the mode button</li>
<li>the boot loader prompt appears in the terminal emulation software
on the PC.</li>
</ol>
</div>


<ol class="org-ol">
<li><a id="orgfc1711e"></a>Process of recovering<br />
<div class="outline-text-5" id="text-1-1-4-1">
<ol class="org-ol">
<li>set the BOOT variable through the command <code>set BOOT=__file_location_here__</code></li>
<li>initialize the flash file system using <code>flash_init</code></li>
<li>after initializing the flash file system, it can be viewed using
the command <code>dir flash:</code></li>
<li>use the command <code>BOOT=flash</code> to change the boot environment
variable path te switch uses to load the new IOS in flash</li>
<li>(verification) issue the <code>set</code> command</li>
<li>enter <code>boot</code> to load the new IOS type</li>
</ol>
</div>
</li>
</ol>
</div>

<div id="outline-container-orgdb20cc1" class="outline-4">
<h4 id="orgdb20cc1"><span class="section-number-4">1.1.5.</span> Switch Management Access</h4>
<div class="outline-text-4" id="text-1-1-5">
<p>
To prepare for remote management access, a switch must have a <b>SVI
(switch virtual interface)</b> configured with an <b>IPv4 address and a
subnet mask</b> or <b>IPv6 and a prefix length</b>.
</p>

<p>
SVI
</p>
<ul class="org-ul">
<li>is not a physical port on the switch</li>
</ul>

<p>
<i>NOTE</i>: to manage a switch from a remote network, it must be
configured with a <b>default gateway</b> (similar to how end devices need
a default gateway).
</p>
</div>
</div>
