Lesson-1.org
***  Switch SVI Configuration Example
1. Configure the management interface on S1
#+NAME: configuration example
#+BEGIN_SRC 
enable
configure terminal
int vlan vlan-id
ip add 172.17.99.11 255.255.255.0
ipv6 add 2001:db8:acad:99::11/64
no shutdown
#+END_SRC

2. Confiture the default gateway
#+NAME: default gateway config
#+BEGIN_SRC 
enable
configure terminal
ip default-gateway address-here
do copy running-config startup-config
end
#+END_SRC

3. verify configuration
#+NAME: verify config
#+BEGIN_SRC 
enable
show ip interface brief
show ipv6 interface brief
#+END_SRC

/NOTE/: The vlan must be existing and a device must to commented to
the switch port for the SVI on the vlan to be up/up


** 1.2 Configure Switch Ports

***  Duplex Communication
Full-duplex communication
- increases bandwidth efficiency by allowing both ends of a connection
  to transmit and receive data simultaneously
- aka *bidirectional communication*
- requires *microsegmentation*
  - a microsegmented LAN is created when a switchport has only one
    device connected and is oprtating in full duplex mode
- There is no collision domain


Half-duplex communication
- unidirectional (one direction)
- creates performance issues because data can flow in only one
  direction at a time, often results in collusions
- are typically seen in older hardware such as *hubs*
- have been replaced by swithes that use full-duplex communication by
  default


/NOTE/: Gigabit Ethernet and 10Gb/s NICs require a full duplex
connections to operate. 

***  Configure switch ports at the physical layer
~duplex~ command (interface configuration mode)
- used to specify the duplex mode for a switch port


~speed~ command (interface configuration mode)
- use to manually specify the speed


The default setting for both duplex and speed for switch ports on
Cisco Catalyst 2960 and 3560 switches is auto. The 10/100/1000 ports
operate in either half- or full-duplex mode when they are set to 10 or
100 Mbps and operate only in full- duplex mode when it is set to 1000
Mbps (1 Gbps).


Autonegotiation
- useful when the speed and duplex of the device connecting to the
  port are unknown or may change
- best practice is to set the speed and duplex settings manually


/NOTE/: mismatched settings for the duplex mode and speed of switch
ports can cause connectivity issues. Autonegotiation failure creates
mismatched settings

***  Auto-MDIX (automatic medium-dependent-interface crossover)
- eliminates the problem of using certain cable types
  (straight-through and crossover) to when connecting devices
- When enabled, the interface automatically detects the required cable
  connection type and configures the connection appropriately
- without it, straight-through and crossover cables must be used appropriately
- the interface configuration command ~mdix auto~ enables the
  auto-MDIX in a specific interface


To *examine the auto-MDIX setting for a specific interface~
use the command ~show controllers ethernet-controller~ command

***  verify switch port configuration
~show running-config~ can be used if the switch is correctly
configured. It shows the switchport modes,  ip addresses, default
gateways, and other useful information when debugging a configuration


~show interfaces~ command displays *status and statistics information*
on the network interfaces of the switch

***  Network Access layer issues
The output from the ~show interfaces~ command is useful for detecting
common media issues. [take into consideration the output of the line
and data link protocol status]

**** Common errors detected by the show interface command
| Error Type      | Description                                                                                              |
|-----------------+----------------------------------------------------------------------------------------------------------|
| input errors    | total number of errors                                                                                   |
|                 | includes runts, giants, no buffer, CRC, frame, overrun, and ignored counts                               |
| runts           | frames smaller than the minimum packet size (64bytes)                                                    |
|                 |                                                                                                          |
| Giants          | ethernet frame greater than 1518 bytes                                                                   |
|                 |                                                                                                          |
| CRC             | generated when the calculated checksum is not the same as the checksum received                          |
|                 |                                                                                                          |
| output errors   | sum of all errors that prevented the final transmission of datagrams out of the interface being examined |
|                 |                                                                                                          |
| collissions     | number of messages retransmitted because of an ethernet collision                                        |
|                 |                                                                                                          |
| late collisions | a collision that occurs after the 512 bits of the frame have been transmitted                            |

***  Interface input and output errors
Input errors
- sum of all errors in datagrams that were received on the interface
  being examined (runts, giants, CRC, no buffer, frame, overrun, and
  ignored counts)


Output errors
- sum of all errors that prevented the final transmission of datagrams
  out the interface that is being examined. (collisions, late collisions)

***  Troubleshooting network access layer issues
Use the ~show interfaces~ command to check the interface status

**** interface is down
- check to make sure that the proper cables are being used (check the connections)
- if still down, check the speed settings

**** interface is up but issues with conenctivity are still present
- using the command ~show interfaces~, check for indications of
  excessive noise. Check the statistics (input and output
  errors). Also, check the cable length
- if noise is not an issue, check for excessive collisions. if there
  are *collisions or late collisions*, verify the duplex settings on
  both ends of the conenction

** Secure remote access

