Lesson-1.html

<div id="outline-container-org8291062" class="outline-4">
<h4 id="org8291062"><span class="section-number-4">1.1.6.</span> Switch SVI Configuration Example</h4>
<div class="outline-text-4" id="text-1-1-6">
<ol class="org-ol">
<li>Configure the management interface on S1</li>
</ol>
<pre class="example" id="orgea0ac89">
enable
configure terminal
int vlan vlan-id
ip add 172.17.99.11 255.255.255.0
ipv6 add 2001:db8:acad:99::11/64
no shutdown
</pre>

<ol class="org-ol">
<li>Confiture the default gateway</li>
</ol>
<pre class="example" id="org7d5683d">
enable
configure terminal
ip default-gateway address-here
do copy running-config startup-config
end
</pre>

<ol class="org-ol">
<li>verify configuration</li>
</ol>
<pre class="example" id="org51d31bb">
enable
show ip interface brief
show ipv6 interface brief
</pre>

<p>
<i>NOTE</i>: The vlan must be existing and a device must to commented to
the switch port for the SVI on the vlan to be up/up
</p>
</div>
</div>
</div>


<div id="outline-container-org1926a14" class="outline-3">
<h3 id="org1926a14"><span class="section-number-3">1.2.</span> 1.2 Configure Switch Ports</h3>
<div class="outline-text-3" id="text-1-2">
</div>
<div id="outline-container-orgf407865" class="outline-4">
<h4 id="orgf407865"><span class="section-number-4">1.2.1.</span> Duplex Communication</h4>
<div class="outline-text-4" id="text-1-2-1">
<p>
Full-duplex communication
</p>
<ul class="org-ul">
<li>increases bandwidth efficiency by allowing both ends of a connection
to transmit and receive data simultaneously</li>
<li>aka <b>bidirectional communication</b></li>
<li>requires <b>microsegmentation</b>
<ul class="org-ul">
<li>a microsegmented LAN is created when a switchport has only one
device connected and is oprtating in full duplex mode</li>
</ul></li>
<li>There is no collision domain</li>
</ul>


<p>
Half-duplex communication
</p>
<ul class="org-ul">
<li>unidirectional (one direction)</li>
<li>creates performance issues because data can flow in only one
direction at a time, often results in collusions</li>
<li>are typically seen in older hardware such as <b>hubs</b></li>
<li>have been replaced by swithes that use full-duplex communication by
default</li>
</ul>


<p>
<i>NOTE</i>: Gigabit Ethernet and 10Gb/s NICs require a full duplex
connections to operate. 
</p>
</div>
</div>

<div id="outline-container-org6c8187f" class="outline-4">
<h4 id="org6c8187f"><span class="section-number-4">1.2.2.</span> Configure switch ports at the physical layer</h4>
<div class="outline-text-4" id="text-1-2-2">
<p>
<code>duplex</code> command (interface configuration mode)
</p>
<ul class="org-ul">
<li>used to specify the duplex mode for a switch port</li>
</ul>


<p>
<code>speed</code> command (interface configuration mode)
</p>
<ul class="org-ul">
<li>use to manually specify the speed</li>
</ul>


<p>
The default setting for both duplex and speed for switch ports on
Cisco Catalyst 2960 and 3560 switches is auto. The 10/100/1000 ports
operate in either half- or full-duplex mode when they are set to 10 or
100 Mbps and operate only in full- duplex mode when it is set to 1000
Mbps (1 Gbps).
</p>


<p>
Autonegotiation
</p>
<ul class="org-ul">
<li>useful when the speed and duplex of the device connecting to the
port are unknown or may change</li>
<li>best practice is to set the speed and duplex settings manually</li>
</ul>


<p>
<i>NOTE</i>: mismatched settings for the duplex mode and speed of switch
ports can cause connectivity issues. Autonegotiation failure creates
mismatched settings
</p>
</div>
</div>

<div id="outline-container-org2e4a2aa" class="outline-4">
<h4 id="org2e4a2aa"><span class="section-number-4">1.2.3.</span> Auto-MDIX (automatic medium-dependent-interface crossover)</h4>
<div class="outline-text-4" id="text-1-2-3">
<ul class="org-ul">
<li>eliminates the problem of using certain cable types
(straight-through and crossover) to when connecting devices</li>
<li>When enabled, the interface automatically detects the required cable
connection type and configures the connection appropriately</li>
<li>without it, straight-through and crossover cables must be used appropriately</li>
<li>the interface configuration command <code>mdix auto</code> enables the
auto-MDIX in a specific interface</li>
</ul>


<p>
To *examine the auto-MDIX setting for a specific interface~
use the command <code>show controllers ethernet-controller</code> command
</p>
</div>
</div>

<div id="outline-container-orgbf14f78" class="outline-4">
<h4 id="orgbf14f78"><span class="section-number-4">1.2.4.</span> verify switch port configuration</h4>
<div class="outline-text-4" id="text-1-2-4">
<p>
<code>show running-config</code> can be used if the switch is correctly
configured. It shows the switchport modes,  ip addresses, default
gateways, and other useful information when debugging a configuration
</p>


<p>
<code>show interfaces</code> command displays <b>status and statistics information</b>
on the network interfaces of the switch
</p>
</div>
</div>

<div id="outline-container-org73b8a8f" class="outline-4">
<h4 id="org73b8a8f"><span class="section-number-4">1.2.5.</span> Network Access layer issues</h4>
<div class="outline-text-4" id="text-1-2-5">
<p>
The output from the <code>show interfaces</code> command is useful for detecting
common media issues. [take into consideration the output of the line
and data link protocol status]
</p>
</div>

<ol class="org-ol">
<li><a id="org43eca0a"></a>Common errors detected by the show interface command<br />
<div class="outline-text-5" id="text-1-2-5-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Error Type</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">input errors</td>
<td class="org-left">total number of errors</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">includes runts, giants, no buffer, CRC, frame, overrun, and ignored counts</td>
</tr>

<tr>
<td class="org-left">runts</td>
<td class="org-left">frames smaller than the minimum packet size (64bytes)</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Giants</td>
<td class="org-left">ethernet frame greater than 1518 bytes</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">CRC</td>
<td class="org-left">generated when the calculated checksum is not the same as the checksum received</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">output errors</td>
<td class="org-left">sum of all errors that prevented the final transmission of datagrams out of the interface being examined</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">collissions</td>
<td class="org-left">number of messages retransmitted because of an ethernet collision</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">late collisions</td>
<td class="org-left">a collision that occurs after the 512 bits of the frame have been transmitted</td>
</tr>
</tbody>
</table>
</div>
</li>
</ol>
</div>

<div id="outline-container-org1d8e421" class="outline-4">
<h4 id="org1d8e421"><span class="section-number-4">1.2.6.</span> Interface input and output errors</h4>
<div class="outline-text-4" id="text-1-2-6">
<p>
Input errors
</p>
<ul class="org-ul">
<li>sum of all errors in datagrams that were received on the interface
being examined (runts, giants, CRC, no buffer, frame, overrun, and
ignored counts)</li>
</ul>


<p>
Output errors
</p>
<ul class="org-ul">
<li>sum of all errors that prevented the final transmission of datagrams
out the interface that is being examined. (collisions, late collisions)</li>
</ul>
</div>
</div>

<div id="outline-container-org035ab59" class="outline-4">
<h4 id="org035ab59"><span class="section-number-4">1.2.7.</span> Troubleshooting network access layer issues</h4>
<div class="outline-text-4" id="text-1-2-7">
<p>
Use the <code>show interfaces</code> command to check the interface status
</p>
</div>

<ol class="org-ol">
<li><a id="org916ef6e"></a>interface is down<br />
<div class="outline-text-5" id="text-1-2-7-1">
<ul class="org-ul">
<li>check to make sure that the proper cables are being used (check the connections)</li>
<li>if still down, check the speed settings</li>
</ul>
</div>
</li>

<li><a id="orgab019ba"></a>interface is up but issues with conenctivity are still present<br />
<div class="outline-text-5" id="text-1-2-7-2">
<ul class="org-ul">
<li>using the command <code>show interfaces</code>, check for indications of
excessive noise. Check the statistics (input and output
errors). Also, check the cable length</li>
<li>if noise is not an issue, check for excessive collisions. if there
are <b>collisions or late collisions</b>, verify the duplex settings on
both ends of the conenction</li>
</ul>
</div>
</li>
</ol>
</div>
</div>

<div id="outline-container-orgafeae6d" class="outline-3">
<h3 id="orgafeae6d"><span class="section-number-3">1.3.</span> Secure remote access</h3>
<div class="outline-text-3" id="text-1-3">
</div>
