Lesson-1.org
*** Telnet operation
Telnet uses transmission control protocol (TCP) port 23. It is an
older protocol that uses unsecure plain text transmission of both the
login and authentication and the data transmitted between
communicating devices. A threat actor can monitor packets using tools
such as wireshark.

*** SSH Operation
Is a secure protocol that uses TCP port 22. It provices a secure
management connection to a remote device. SSH should replace telnet
for management connections. SSH provides security for remote
conenctions by providing strong encryption when a device is
authenticated and also for the transmitted data between the
comminicating devices

*** Verify the switch supports SSH
SSH can only be used by devices with an IOS software including
cryptographic features and capabilities. Use the ~show version~
command to see the current IOS running. An IOS with a name that
includes "k9" is one that supports cryptographic features and
capabilities. 

*** Configure SSH
SSH requires a unique hostname and corry network connectivity setings

**** Step 1: Verify SSH Support
~show ip ssh~ command to verify if the switch supports SSH

**** Step 2: Configure the IP domain
~ip domain-name domain-name~ command to set the domain name 

**** Step 3: Generate the RSA key pairs
Some IOS variants default to SSH version 2 and version 1. To configure
SSH version 2, issue the command *~ip ssh version 2~*. To generate a
Rivest, Shamit, Adleman (RSA) key pair to automatically enable SSH,
use the command ~crypto key generate rsa general-keys modulus 1024~

/NOTE/: To delete the RSA key pair ~crypto key zeroize rsa~

**** Configure user authentication
create a username and password useing the command ~username
your-username password your-password~ 

**** Configure the vty lines
Enable the SSH protocol on the vty lines using the ~transport input
ssh~ and ~login local~ line configuration mode command. 

**** Enable SSH version 2
~ip ssh version 2~ global configuration mode command

*** Verify SSH
Connect using a pc ~ssh -l ip-address-of-device~ command line command

** Basic Router Configuration

*** Configure basic router settings

#+NAME: Basic router config
#+BEGIN_SRC 
enable
configure terminal
hostname R1
enable secret class
line console 0
password cisco
login
exit
line vty 0 4
password cisco
login
exit
service password-encryption
banner motd "Authorized access only!"
end
copy running-config startup-config
#+END_SRC

*** Dual Stack Topology
Configuration of routers in both IPv4 and IPv6

*** Configure Router Interfaces

*** IPv4 Loopback Interfaces
Is a logical interface that is internal to the router. It is not
assigned to a phycial port and can never be connected to any other
device. It is considered as a *software interface* that is
automatically placed in an "up" state as long as the router is
functioning.


It is *useful if testing and managing* a Cisco IOS device as it
ensures that at least one interface will always be available.

#+NAME: Assigning a loopback address
#+BEGIN_SRC 
enable
configure terminal
interface loopback number
ip address ip-here subnet-here
#+END_SRC

** Verify Directly Connected Networks

*** Interface verification commands
use the following commands to quickly identify the status of
interfaces
#+NAME: verification of router interfaces
#+BEGIN_SRC 
show ip interface brief
show ipv6 interface brief
show ip interface g0/1
show ipv6 interface g0/1
show running-config interface interface-id
show ip route
show ipv6 route
#+END_SRC

*** Verify Interface Status
~show ip interface brief~ and ~show ipv6 interface brief~ can be used
to quickly reveal the status of all interfaces on the router. 

*** Verify IPv6 Link Local and Multicase Addresses
~show ipv6 interface brief~

*** Verify Routes
#+NAME: route verification
#+BEGIN_SRC 
show ip route
show ipv6 route
ping address
#+END_SRC

*** Filter Show Command Output
The pipe "|" character is used to filter comands. The commands
~section~, ~include~, ~exclude~, and ~begin~ are used with the pipe
character to filter show commands.

*** Command History Feature
CTRL+P go to previous command and CTRL+N go to next. ~show history~
privileged exec mode command will show the last 10 captured
commands. To change the size, the command ~terminal history size
new-size~ can be used.

[[file:README.org][HOME]]
