Lesson-1.html
<div id="outline-container-orga73005c" class="outline-4">
<h4 id="orga73005c"><span class="section-number-4">1.3.1.</span> Telnet operation</h4>
<div class="outline-text-4" id="text-1-3-1">
<p>
Telnet uses transmission control protocol (TCP) port 23. It is an
older protocol that uses unsecure plain text transmission of both the
login and authentication and the data transmitted between
communicating devices. A threat actor can monitor packets using tools
such as wireshark.
</p>
</div>
</div>

<div id="outline-container-org7b441f7" class="outline-4">
<h4 id="org7b441f7"><span class="section-number-4">1.3.2.</span> SSH Operation</h4>
<div class="outline-text-4" id="text-1-3-2">
<p>
Is a secure protocol that uses TCP port 22. It provices a secure
management connection to a remote device. SSH should replace telnet
for management connections. SSH provides security for remote
conenctions by providing strong encryption when a device is
authenticated and also for the transmitted data between the
comminicating devices
</p>
</div>
</div>

<div id="outline-container-org7136b21" class="outline-4">
<h4 id="org7136b21"><span class="section-number-4">1.3.3.</span> Verify the switch supports SSH</h4>
<div class="outline-text-4" id="text-1-3-3">
<p>
SSH can only be used by devices with an IOS software including
cryptographic features and capabilities. Use the <code>show version</code>
command to see the current IOS running. An IOS with a name that
includes "k9" is one that supports cryptographic features and
capabilities. 
</p>
</div>
</div>

<div id="outline-container-org065cd94" class="outline-4">
<h4 id="org065cd94"><span class="section-number-4">1.3.4.</span> Configure SSH</h4>
<div class="outline-text-4" id="text-1-3-4">
<p>
SSH requires a unique hostname and corry network connectivity setings
</p>
</div>

<ol class="org-ol">
<li><a id="org43a5a81"></a>Step 1: Verify SSH Support<br />
<div class="outline-text-5" id="text-1-3-4-1">
<p>
<code>show ip ssh</code> command to verify if the switch supports SSH
</p>
</div>
</li>

<li><a id="org5584034"></a>Step 2: Configure the IP domain<br />
<div class="outline-text-5" id="text-1-3-4-2">
<p>
<code>ip domain-name domain-name</code> command to set the domain name 
</p>
</div>
</li>

<li><a id="org3c6e713"></a>Step 3: Generate the RSA key pairs<br />
<div class="outline-text-5" id="text-1-3-4-3">
<p>
Some IOS variants default to SSH version 2 and version 1. To configure
SSH version 2, issue the command <b><code>ip ssh version 2</code></b>. To generate a
Rivest, Shamit, Adleman (RSA) key pair to automatically enable SSH,
use the command <code>crypto key generate rsa general-keys modulus 1024</code>
</p>

<p>
<i>NOTE</i>: To delete the RSA key pair <code>crypto key zeroize rsa</code>
</p>
</div>
</li>

<li><a id="org02d782d"></a>Configure user authentication<br />
<div class="outline-text-5" id="text-1-3-4-4">
<p>
create a username and password useing the command <code>username
your-username password your-password</code> 
</p>
</div>
</li>

<li><a id="org2cdf045"></a>Configure the vty lines<br />
<div class="outline-text-5" id="text-1-3-4-5">
<p>
Enable the SSH protocol on the vty lines using the <code>transport input
ssh</code> and <code>login local</code> line configuration mode command. 
</p>
</div>
</li>

<li><a id="org52b4578"></a>Enable SSH version 2<br />
<div class="outline-text-5" id="text-1-3-4-6">
<p>
<code>ip ssh version 2</code> global configuration mode command
</p>
</div>
</li>
</ol>
</div>

<div id="outline-container-orge0d46e5" class="outline-4">
<h4 id="orge0d46e5"><span class="section-number-4">1.3.5.</span> Verify SSH</h4>
<div class="outline-text-4" id="text-1-3-5">
<p>
Connect using a pc <code>ssh -l ip-address-of-device</code> command line command
</p>
</div>
</div>
</div>

<div id="outline-container-org7b611e7" class="outline-3">
<h3 id="org7b611e7"><span class="section-number-3">1.4.</span> Basic Router Configuration</h3>
<div class="outline-text-3" id="text-1-4">
</div>
<div id="outline-container-org621e905" class="outline-4">
<h4 id="org621e905"><span class="section-number-4">1.4.1.</span> Configure basic router settings</h4>
<div class="outline-text-4" id="text-1-4-1">
<pre class="example" id="orgd8d74dc">
enable
configure terminal
hostname R1
enable secret class
line console 0
password cisco
login
exit
line vty 0 4
password cisco
login
exit
service password-encryption
banner motd "Authorized access only!"
end
copy running-config startup-config
</pre>
</div>
</div>

<div id="outline-container-org955d1da" class="outline-4">
<h4 id="org955d1da"><span class="section-number-4">1.4.2.</span> Dual Stack Topology</h4>
<div class="outline-text-4" id="text-1-4-2">
<p>
Configuration of routers in both IPv4 and IPv6
</p>
</div>
</div>

<div id="outline-container-org0318299" class="outline-4">
<h4 id="org0318299"><span class="section-number-4">1.4.3.</span> Configure Router Interfaces</h4>
</div>

<div id="outline-container-org8dd629b" class="outline-4">
<h4 id="org8dd629b"><span class="section-number-4">1.4.4.</span> IPv4 Loopback Interfaces</h4>
<div class="outline-text-4" id="text-1-4-4">
<p>
Is a logical interface that is internal to the router. It is not
assigned to a phycial port and can never be connected to any other
device. It is considered as a <b>software interface</b> that is
automatically placed in an "up" state as long as the router is
functioning.
</p>


<p>
It is <b>useful if testing and managing</b> a Cisco IOS device as it
ensures that at least one interface will always be available.
</p>

<pre class="example" id="orga726568">
enable
configure terminal
interface loopback number
ip address ip-here subnet-here
</pre>
</div>
</div>
</div>

<div id="outline-container-orgcc90b5b" class="outline-3">
<h3 id="orgcc90b5b"><span class="section-number-3">1.5.</span> Verify Directly Connected Networks</h3>
<div class="outline-text-3" id="text-1-5">
</div>
<div id="outline-container-orgeab2f30" class="outline-4">
<h4 id="orgeab2f30"><span class="section-number-4">1.5.1.</span> Interface verification commands</h4>
<div class="outline-text-4" id="text-1-5-1">
<p>
use the following commands to quickly identify the status of
interfaces
</p>
<pre class="example" id="orge5b5537">
show ip interface brief
show ipv6 interface brief
show ip interface g0/1
show ipv6 interface g0/1
show running-config interface interface-id
show ip route
show ipv6 route
</pre>
</div>
</div>

<div id="outline-container-org63689f2" class="outline-4">
<h4 id="org63689f2"><span class="section-number-4">1.5.2.</span> Verify Interface Status</h4>
<div class="outline-text-4" id="text-1-5-2">
<p>
<code>show ip interface brief</code> and <code>show ipv6 interface brief</code> can be used
to quickly reveal the status of all interfaces on the router. 
</p>
</div>
</div>

<div id="outline-container-org6ee1152" class="outline-4">
<h4 id="org6ee1152"><span class="section-number-4">1.5.3.</span> Verify IPv6 Link Local and Multicase Addresses</h4>
<div class="outline-text-4" id="text-1-5-3">
<p>
<code>show ipv6 interface brief</code>
</p>
</div>
</div>

<div id="outline-container-org8d5f464" class="outline-4">
<h4 id="org8d5f464"><span class="section-number-4">1.5.4.</span> Verify Routes</h4>
<div class="outline-text-4" id="text-1-5-4">
<pre class="example" id="orgd074cd0">
show ip route
show ipv6 route
ping address
</pre>
</div>
</div>

<div id="outline-container-org4227c38" class="outline-4">
<h4 id="org4227c38"><span class="section-number-4">1.5.5.</span> Filter Show Command Output</h4>
<div class="outline-text-4" id="text-1-5-5">
<p>
The pipe "|" character is used to filter comands. The commands
<code>section</code>, <code>include</code>, <code>exclude</code>, and <code>begin</code> are used with the pipe
character to filter show commands.
</p>
</div>
</div>

<div id="outline-container-orgcb5676b" class="outline-4">
<h4 id="orgcb5676b"><span class="section-number-4">1.5.6.</span> Command History Feature</h4>
<div class="outline-text-4" id="text-1-5-6">
<p>
CTRL+P go to previous command and CTRL+N go to next. <code>show history</code>
privileged exec mode command will show the last 10 captured
commands. To change the size, the command <code>terminal history size
new-size</code> can be used.
</p>

<p>
<a href="README.html">HOME</a>
</p>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Emmanuel Parreno</p>
<p class="date">Created: 2025-02-10 Mon 07:32</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
